{
  "id": "9d6a816a-612c-4f50-90f6-8f043db2a775",
  "meta": {
    "name": "deep-prognosis",
    "application_area": "Lung CT",
    "task": "Prognosis",
    "task_extended": "2-year survival of NSCLC patients",
    "data_type": "Computed Tomography (CT)",
    "data_source": "https://wiki.cancerimagingarchive.net/display/Public/NSCLC-Radiomics"
  },
  "publication": {
    "title": "Deep learning for lung cancer prognostication: A retrospective multi-cohort radiomics study",
    "source": "PLOS Medicine",
    "year": 2018,
    "authors": "Ahmed Hosny, Chintan Parmar, Thibaud P. Coroller, Patrick Grossmann, Roman Zeleznik, Avnish Kumar, Johan Bussink, Robert J. Gillies, Raymond H. Mak, Hugo J. W. L. Aerts",
    "abstract": "Background: Non-small-cell lung cancer (NSCLC) patients often demonstrate varying clinical courses and outcomes, even within the same tumor stage. This study explores deep learning applications in medical imaging allowing for the automated quantification of radiographic characteristics and potentially improving patient stratification. Methods and findings: We performed an integrative analysis on 7 independent datasets across 5 institutions totaling 1,194 NSCLC patients (age median = 68.3 years [range 32.5–93.3], survival median = 1.7 years [range 0.0–11.7]). Using external validation in computed tomography (CT) data, we identified prognostic signatures using a 3D convolutional neural network (CNN) for patients treated with radiotherapy (n = 771, age median = 68.0 years [range 32.5–93.3], survival median = 1.3 years [range 0.0–11.7]). We then employed a transfer learning approach to achieve the same for surgery patients (n = 391, age median = 69.1 years [range 37.2–88.0], survival median = 3.1 years [range 0.0–8.8]). We found that the CNN predictions were significantly associated with 2-year overall survival from the start of respective treatment for radiotherapy (area under the receiver operating characteristic curve [AUC] = 0.70 [95% CI 0.63–0.78], p < 0.001) and surgery (AUC = 0.71 [95% CI 0.60–0.82], p < 0.001) patients. The CNN was also able to significantly stratify patients into low and high mortality risk groups in both the radiotherapy (p < 0.001) and surgery (p = 0.03) datasets. Additionally, the CNN was found to significantly outperform random forest models built on clinical parameters—including age, sex, and tumor node metastasis stage—as well as demonstrate high robustness against test–retest (intraclass correlation coefficient = 0.91) and inter-reader (Spearman’s rank-order correlation = 0.88) variations. To gain a better understanding of the characteristics captured by the CNN, we identified regions with the most contribution towards predictions and highlighted the importance of tumor-surrounding tissue in patient stratification. We also present preliminary findings on the biological basis of the captured phenotypes as being linked to cell cycle and transcriptional processes. Limitations include the retrospective nature of this study as well as the opaque black box nature of deep learning networks. Conclusions: Our results provide evidence that deep learning networks may be used for mortality risk stratification based on standard-of-care CT images from NSCLC patients. This evidence motivates future research into better deciphering the clinical and biological basis of deep learning networks as well as validation in prospective data.",
    "url": "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1002711",
    "google_scholar": "https://scholar.google.com/scholar?oi=bibs&hl=en&cites=8976487770990178044",
    "bibtex": "@article{10.1371/journal.pmed.1002711, author = {Hosny, Ahmed AND Parmar, Chintan AND Coroller, Thibaud P. AND Grossmann, Patrick AND Zeleznik, Roman AND Kumar, Avnish AND Bussink, Johan AND Gillies, Robert J. AND Mak, Raymond H. AND Aerts, Hugo J. W. L.}, journal = {PLOS Medicine}, publisher = {Public Library of Science}, title = {Deep learning for lung cancer prognostication: A retrospective multi-cohort radiomics study}, year = {2018}, month = {11}, volume = {15}, url = {https://doi.org/10.1371/journal.pmed.1002711}, pages = {1-25}, abstract = {Hugo Aerts and colleagues evaluate the ability of deep learning networks to extract relevant features from computed tomography lung cancer images and stratify patients into low and high mortality risk groups.}, number = {11}, doi = {10.1371/journal.pmed.1002711}}"
  },
  "model": {
    "description": "This model predicts the survival likelihood of non-small cell lung cancer patients 2 years after the start of radiotherapy treatment.",
    "provenance": "contributed by author",
    "architecture": "Convolutional neural network with fully connected layers.",
    "learning_type": "Supervised learning",
    "format": ".h5",
    "io": {
      "input": {
        "format": ["application/octet-stream"],
        "dim_limits": [
          {
            "min": 150,
            "max": 150
          },
          {
            "min": 150,
            "max": 150
          },
          {
            "min": 150,
            "max": 150
          }
        ],
        "description": "numpy array (.npy) of the given dimensions centered around the tumor center of mass."
      },
      "output": [
        {
          "name": "Survival prediction",
          "type": "label_list"
        },
        {
          "name": "features",
          "type": "label_list",
          "description": "256 features from the penultimate fully connected layer"
        }
      ]
    }
  },
  "modelhub": {}
}
